auth/app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts"
---
  def index
    @accounts = Account.all

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 ORDER BY "accounts"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_account
      @account = Account.find(params[:id])